; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 689261 2 2 3 4 4
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	image1 - mode
	infrared0 - mode
	thermograph2 - mode
	GroundStation2 - direction
	Star1 - direction
	Star0 - direction
	GroundStation3 - direction
	Star4 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Star7 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 thermograph2)
	(supports instrument0 image1)
	(calibration_target instrument0 Star1)
	(supports instrument1 thermograph2)
	(supports instrument1 infrared0)
	(supports instrument1 image1)
	(calibration_target instrument1 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(supports instrument2 infrared0)
	(supports instrument2 image1)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 GroundStation3)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation3)
)
(:goal (and
	(have_image Star4 thermograph2)
	(have_image Phenomenon5 thermograph2)
	(have_image Phenomenon6 image1)
	(have_image Star7 thermograph2)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 4
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 4
3. (turn_to satellite1 star4 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 star4)
   goals met: 0 of 4
4. (calibrate satellite0 instrument0 star1)
   added: (calibrated instrument0)
   goals met: 0 of 4
5. (turn_to satellite1 phenomenon6 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 phenomenon6)
   goals met: 0 of 4
6. (turn_to satellite0 star7 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star7)
   goals met: 0 of 4
7. (turn_to satellite1 phenomenon5 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 phenomenon5)
   goals met: 0 of 4
8. (take_image satellite0 star7 instrument0 thermograph2)
   added: (have_image star7 thermograph2)
   goals met: 1 of 4
9. (turn_to satellite1 phenomenon6 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 phenomenon6)
   goals met: 1 of 4
10. (turn_to satellite0 star4 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star4)
   goals met: 1 of 4
11. (turn_to satellite1 phenomenon5 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 phenomenon5)
   goals met: 1 of 4
12. (take_image satellite0 star4 instrument0 thermograph2)
   added: (have_image star4 thermograph2)
   goals met: 2 of 4
13. (turn_to satellite1 groundstation3 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 groundstation3)
   goals met: 2 of 4
14. (turn_to satellite0 phenomenon6 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 phenomenon6)
   goals met: 2 of 4
15. (calibrate satellite1 instrument2 groundstation3)
   added: (calibrated instrument2)
   goals met: 2 of 4
16. (take_image satellite0 phenomenon6 instrument0 image1)
   added: (have_image phenomenon6 image1)
   goals met: 3 of 4
17. (turn_to satellite1 phenomenon5 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 phenomenon5)
   goals met: 3 of 4
18. (take_image satellite1 phenomenon5 instrument2 thermograph2)
   added: (have_image phenomenon5 thermograph2)
   goals met: 4 of 4
